app/controllers/students_controller.rb

  def create
    @student = Student.new(student_parmas}
    @student.save
    redirect_to student_path(@student)
  end

  def update
    @student = Student.find(params[:id])
    @studnet.update(student_params)
    redirect_to student_path(@student)
  end



end

---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-10-01 21:23:55.037446"], ["updated_at", "2019-10-01 21:23:55.037446"]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]